#+TITLE: WIP: DNS: add canary
#+AUTHOR: Hippie Hacker
#+EMAIL: hh@ii.coop
#+ISSUE: https://github.com/kubernetes/k8s.io/pull/147
#+CREATOR: ii.coop
#+DATE: October 24th, 2018
#+PROPERTY: header-args:tmate  :socket (symbol-value 'socket)
#+PROPERTY: header-args:tmate+ :session (file-name-base buffer-file-name)
#+PROPERTY: header-args:shell  :var SOCKET=(symbol-value 'socket)
#+PROPERTY: header-args:shell+ :results verbatim code
#+PROPERTY: header-args:shell+ :wrap "EXAMPLE"


octodns-compare does similar comparison type stuff,
 though it works at the provider level

octodns-report does actual DNS queries against servers

using octoDNS to get the list of things to check.

** Secrets / ENV Setup
 #+NAME: create project configuration
 #+BEGIN_SRC tmate
   export PROJECT=kubernetes-public
   export EMAIL=hh@ii.coop

   gcloud config configurations create $PROJECT --activate \
     || gcloud config configurations activate $PROJECT
   gcloud config set account $EMAIL
   gcloud config set project $PROJECT
 #+END_SRC
 
#+NAME: create project configuration
 #+BEGIN_SRC tmate
   export PROJECT=kubernetes-public
   export EMAIL=hh@ii.coop

   gcloud config configurations create $PROJECT --activate \
     || gcloud config configurations activate $PROJECT
   gcloud config set account $EMAIL
   gcloud config set project $PROJECT
 #+END_SRC

#+NAME: test canary
#+BEGIN_SRC tmate
  (
    cd ~/kubernetes/k8s.io/dns
    ~/kubernetes/k8s.io/dns/test.sh canary
    echo exit=$?
  ) 2>&1
#+END_SRC

#+NAME: test.sh canary
#+BEGIN_SRC shell :results verbatim :path ~/kubernetes/k8s.io/dns
  (
    cd ~/kubernetes/k8s.io/dns
    ~/kubernetes/k8s.io/dns/test.sh canary
    echo exit=$?
  ) 2>&1
#+END_SRC

#+RESULTS: test.sh canary
#+begin_example
canary
Testing canary via ns-cloud-c1.googledomains.com. and ns-cloud-b1.googledomains.com.
1 aspmx.l.google.com. 5 alt1.aspmx.l.google.com. 5 alt2.aspmx.l.google.com. 10 alt3.aspmx.l.google.com. 10 alt4.aspmx.l.google.com.
FAIL: MX canary.k8s.io:
  got:
1 aspmx.l.google.com.
5 alt1.aspmx.l.google.com.
5 alt2.aspmx.l.google.com.
10 alt3.aspmx.l.google.com.
10 alt4.aspmx.l.google.com.
--------------------
exit=2
#+end_example





